[
  {
    "image": "https://i.postimg.cc/8CdHXzcV/Todoist.png",
    "title": "Todoist",
    "companyName": "Doist",
    "id": 1,
    "description": "Todoist is a powerful and highly-regarded task manager that helps you organize tasks, set priorities, and collaborate with others, all based on the principles of getting things done (GTD).It excels at quickly capturing tasks from various inputs and offers a natural language processing engine to set due dates and recurring tasks automatically.The app is cross-platform, ensuring your to-do lists are accessible on desktop, web, and mobile, and it offers deep integration with popular services like Gmail, Slack, and calendars.\nKey features include organizing tasks into projects, using **labels** and **filters** to sort and view specific tasks, and assigning **priority levels** to focus on what matters most.For teams and collaborative projects, Todoist allows for task assignment and project sharing, facilitating seamless teamwork and accountability.\nAdvanced users appreciate the ability to create complex filtering queries and use the karma points system for **productivity reports** and motivation.It is widely praised for its clean, minimalist design that makes managing overwhelming workloads feel manageable and straightforward.This tool is primarily for individuals and teams seeking a reliable, task-focused system to maintain clarity and execute work efficiently.",
    "size": 150,
    "reviews": "1.2M",
    "ratingAvg": 4.7,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 800000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/g2QQbjGq/notion.webp",
    "title": "Notion",
    "companyName": "Notion Labs Inc.",
    "id": 2,
    "description": "Notion is an exceptionally versatile **all-in-one workspace** where you can write, plan, collaborate, and organize nearly any type of information.It replaces several disparate tools by seamlessly integrating notes, databases, task management, project tracking, and team wikis into a single, highly customizable platform.\nIts structure is based on flexible 'blocks' that can be text, images, to-do lists, code snippets, or even embedded applications, all arranged on pages.Databases are a core feature, offering multiple viewing modes like **tables, calendars, boards (Kanban), galleries, and timelines** to visualize data in the most useful way.This high degree of flexibility makes Notion popular for building personal knowledge bases, managing complex product roadmaps, creating company documentation, and even building public websites.\nCollaboration features are robust, allowing real-time editing, commenting, and granular permission controls for sharing pages with team members or the public.The steep learning curve is often cited, but its power lies in the ability to link pages and create complex, relational databases for interconnected information management.It is the ideal choice for users who want to design their *own* organizational system rather than conform to a rigid, predefined structure.",
    "size": 200,
    "reviews": "900K",
    "ratingAvg": 4.8,
    "downloads": "30M",
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 730000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/qR3CDmjw/googlecalendar.png",
    "title": "Google Calendar",
    "companyName": "Google",
    "id": 3,
    "description": "Google Calendar is a widely used, powerful **time-management and scheduling service** developed by Google, deeply integrated across the Google ecosystem.It allows users to create and edit events, set up one-time or recurring appointments, and easily invite others to meetings using their email addresses.\nA key feature is the ability to check the availability of colleagues within the same organization when scheduling, making group coordination simple and efficient.Users can organize events by creating **multiple calendars** (e.g., personal, work, hobby) which can be toggled on and off to manage visual clutter.The platform offers various views—day, week, month, year, and schedule—to help users visualize their time commitment and future plans.\nIt automatically synchronizes with Gmail to suggest adding events (like flight or restaurant reservations) found in emails, enhancing its utility as a daily planner.Goal setting functionality helps users find time in their schedules for personal growth activities, and it integrates seamlessly with video conferencing tools like Google Meet and Zoom.Its vast user base and free availability make it the standard for cross-company and public-facing scheduling, and it’s an essential tool for personal time management.",
    "size": 100,
    "reviews": "2.5M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1950000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/3rZwr541/Slack.png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 4,
    "description": "Slack is a ubiquitous **collaboration hub and instant messaging platform** designed primarily for corporate and project-based communication, fundamentally replacing internal email.It connects your work with the people you work with through organizing conversations into dedicated **channels** based on projects, teams, or topics, promoting transparency.Key functionality includes real-time messaging, file sharing, voice and video calls within the app, and searchable history for quick reference.\nOne of Slack's greatest strengths is its massive ecosystem of **integrations**, allowing users to connect it with hundreds of other business tools like Trello, Google Drive, Asana, and GitHub.Users can send direct messages to individuals, create private groups, and utilize 'threads' to keep channel conversations focused and minimize noise.Features like 'Huddles' and 'Clips' offer quick, impromptu audio and short video messages to facilitate spontaneous team communication.\nIt is essential for remote and hybrid teams, offering features like status updates and user groups (like @design-team) to efficiently coordinate and quickly disseminate information.Slack aims to streamline communication, reduce meeting frequency, and keep all team-related knowledge accessible in a single, organized place.",
    "size": 250,
    "reviews": "1M",
    "ratingAvg": 4.5,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 75000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 425000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/V6gcwwGd/googlekeep.png",
    "title": "Google Keep",
    "companyName": "Google",
    "id": 5,
    "description": "Google Keep is a simple, fast, and lightweight **note-taking service** where users can create, edit, and share notes, lists, photos, and audio recordings.It is designed for quick capture of thoughts and ideas, presenting all content in a vibrant, color-coded sticky-note interface that is easy to visually scan.\nUsers can set both **time-based and location-based reminders**, ensuring they recall a note or task when they arrive at a specific place or at a certain time.Collaboration is straightforward, allowing notes and lists to be shared with family, friends, or colleagues for real-time list management, such as grocery shopping.\nA powerful feature is its ability to transcribe text from images (**OCR**), making it easy to capture information from receipts or whiteboards.It seamlessly integrates with other Google services like Google Docs and Gmail, allowing notes to be easily transferred or referenced.Keep is best suited for quick jottings, ephemeral thoughts, simple checklists, and personal organization rather than long-form writing or complex project management.Its simplicity is its greatest strength, offering a frictionless way to digitize those small but important daily reminders and observations.",
    "size": 80,
    "reviews": "1.5M",
    "ratingAvg": 4.7,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 8000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1060000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/9MRN8h3V/Trellopng.png",
    "title": "Trello",
    "companyName": "Atlassian",
    "id": 6,
    "description": "Trello is a collaboration tool that organizes your projects into **boards**, which are comprised of **lists** and **cards**, following the highly intuitive Kanban methodology.The platform is highly visual and flexible, making it ideal for task management, personal organization, and team collaboration across various project types.Each **card** can contain descriptions, due dates, checklists, attachments, conversations, and member assignments, providing a central hub for all task-related information.\nLists typically represent stages in a workflow (e.g., To Do, Doing, Done), and users move cards between them to track progress, offering an at-a-glance view of a project's status.Its simplicity and drag-and-drop interface make it easy to onboard new users, and it's popular for personal planning, content creation, and small team agile development.\nTrello offers 'Power-Ups' (integrations) to connect with other services like Slack and Google Drive, extending its core functionality with features like calendar view or automation.The tool is effective for maintaining transparency within a team and ensuring everyone knows who is doing what and where a task stands in the overall process.It is the perfect choice for visual thinkers and teams who prefer a lightweight, flexible, and visually-driven project management solution.",
    "size": 150,
    "reviews": "1.3M",
    "ratingAvg": 4.6,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 7000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 860000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/XYtHzvbT/asana.png",
    "title": "Asana",
    "companyName": "Asana, Inc.",
    "id": 7,
    "description": "Asana is a robust web and mobile application designed specifically to help teams organize, track, and manage all of their work, from daily tasks to strategic initiatives.It functions as a comprehensive work management platform, offering multiple project views including lists, **boards (Kanban), calendar, and Gantt-style timelines** for complex project scheduling.Key features revolve around clear accountability, allowing users to assign tasks to specific individuals, set precise due dates, and track task dependencies.\nAsana facilitates cross-functional collaboration by enabling teams to create portfolios for managing groups of projects and to use goals to connect daily work to company objectives.Users can communicate within the context of a task via comments, upload files, and monitor the progress of entire projects through dashboard reporting.Its strength lies in its ability to handle larger, more intricate projects than simpler to-do list apps, providing the structure needed for scale and complexity.\nThe tool also offers rich integrations with common business apps, ensuring it fits into existing workflows like communication (Slack) and file storage (Drive).Asana is best for growing teams and organizations that require a structured, transparent, and scalable system for project execution and process management.",
    "size": 180,
    "reviews": "900K",
    "ratingAvg": 4.5,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 670000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/fWgbp4Vd/onenote.png",
    "title": "Microsoft OneNote",
    "companyName": "Microsoft",
    "id": 8,
    "description": "Microsoft OneNote is a digital note-taking application designed to function as a digital binder where users can gather notes, drawings, screen clippings, and audio commentaries.Its organizational hierarchy is unique: it's structured by **Notebooks, which contain Sections, which contain Pages**, allowing for deep and structured categorization of information.The free-form canvas of each 'page' allows users to place text, images, and other media anywhere, making it highly flexible for meeting notes, research, and brainstorming.\nKey features include excellent support for **handwriting** and sketching using a stylus or finger, making it a favorite for tablet users and students.OneNote seamlessly integrates with the Microsoft 365 ecosystem, allowing users to easily insert content from Word, Excel, and Outlook tasks/events.It offers powerful **search functionality** that can even find text within images (OCR) and handwritten notes, ensuring no piece of information gets lost.\nNotes are automatically synchronized across all devices and shared via the cloud, making it a reliable central repository for all personal and team knowledge.It is best used for collecting and organizing large volumes of diverse information in a structured, multi-media format, functioning as a complete digital archive.",
    "size": 200,
    "reviews": "1M",
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 35000 },
      { "name": "4 star", "count": 450000 },
      { "name": "5 star", "count": 900000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/8c1GqcTh/drive.png",
    "title": "Google Drive",
    "companyName": "Google",
    "id": 9,
    "description": "Google Drive is a leading **cloud storage and file synchronization service** that allows users to store files online, access them from any device, and share them securely with others.It serves as the foundation for the Google Workspace suite, hosting and providing cloud-based access to files created in Google Docs, Sheets, and Slides.\nFiles are automatically synchronized across all connected devices (desktop, mobile, and web), ensuring users always have the latest version of their documents.One of its most important features is its **real-time collaboration** capabilities within Google's native office applications, allowing multiple users to edit a single document simultaneously.Users can organize files into folders, search for content using keywords, and manage detailed sharing permissions to control who can view, comment on, or edit a file.\nIt includes a version history feature, allowing users to revert to previous iterations of a document, a critical feature for collaborative and complex projects.Its seamless integration with Gmail and Google Calendar makes sharing files and coordinating work a standard part of the Google ecosystem workflow.Google Drive is essential for individuals and businesses operating within the Google ecosystem, providing scalable, accessible, and collaborative file management and storage.",
    "size": 300,
    "reviews": "2M",
    "ratingAvg": 4.8,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1120000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/TP4Qz4Gb/dropbox.png",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 11,
    "description": "Dropbox is a veteran **cloud storage and file-syncing service** known for its reliability, ease of use, and robust cross-platform synchronization capabilities.It allows users to back up, store, share, and collaborate on files and folders across all their devices, providing universal access to data.Its core function is to maintain a 'magic pocket' where files are always up-to-date and accessible, regardless of the operating system or device being used.\nKey collaboration tools include easy sharing of links to files and folders, granular access controls, and features for collecting files from external parties via file requests.Dropbox is often used for sharing large files that exceed email limits and for ensuring that teams are working from the most current versions of documents.It offers file version history, allowing users to restore previous versions of a file, which is a crucial safety net against accidental deletions or changes.\nWhile its focus is primarily on file management, it has expanded to include tools like Dropbox Paper for document collaboration and document signing features.It remains a top choice for individuals and creative professionals who prioritize simple, reliable, and secure file storage and sharing outside of a specific office suite ecosystem.",
    "size": 230,
    "reviews": "2.7M",
    "ratingAvg": 4.3,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/Y9WX7Bpf/evernote.png",
    "title": "Evernote",
    "companyName": "Evernote Corporation",
    "id": 12,
    "description": "Evernote is a long-established **note-taking, web clipping, and personal knowledge management** application designed to help users capture, organize, and retrieve information.It excels at capturing almost *anything*—typed notes, handwritten memos, photos of whiteboards, audio clips, and entire webpages using its powerful web clipper.\nInformation is organized into **Notes** that reside within **Notebooks**, which can then be grouped into **Stacks**, providing a flexible structure for complex subjects.A primary strength is its powerful **search capability**, including the ability to search for text within images, PDFs, and even handwritten notes (thanks to its OCR).All notes are synced across all devices, ensuring that a user's entire knowledge library is available offline and accessible wherever they go.It offers robust features for sharing notes and notebooks with others, facilitating collaboration on research, meeting minutes, and project documentation.\nEvernote is often utilized by students and researchers as a 'second brain'—a comprehensive archive for all their learning materials, research sources, and creative output.It is best suited for those whose productivity workflow requires capturing a high volume of diverse content types and needs sophisticated search and archival capabilities.",
    "size": 210,
    "reviews": "1.8M",
    "ratingAvg": 4.4,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 185000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 5500000 },
      { "name": "5 star", "count": 8250000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/vmrfz2Tb/zoom.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 13,
    "description": "Zoom is a leading platform for **video conferencing, online meetings, webinars, and chat**, becoming an essential tool for remote work and education globally.It provides reliable high-definition video and audio quality, supporting meetings with hundreds or even thousands of participants simultaneously.Key features include screen sharing for presentations, annotation tools for real-time collaboration, and the ability to record meetings locally or to the cloud.\nFor large events, it offers **webinar** functionality with Q&A and polling features, and for meetings, it includes breakout rooms to facilitate small-group discussions.Security is managed through various controls, including password protection, waiting rooms, and end-to-end encryption to ensure private conversations remain secure.It includes a robust chat feature for in-meeting communication and persistent chat channels for daily team messaging and file sharing outside of scheduled calls.\nIts simplicity and ease of joining meetings (often just a single click) have contributed to its widespread adoption across corporate, government, and educational sectors.Zoom is the go-to tool for synchronous communication, enabling face-to-face interaction and collaboration regardless of geographical location.",
    "size": 200,
    "reviews": "7M",
    "ratingAvg": 4.1,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/vBP1qJsY/Microsoft-To-Do.png",
    "title": "Microsoft To Do",
    "companyName": "Microsoft",
    "id": 14,
    "description": "Microsoft To Do is an intelligent **task list and daily planner** application, acquired from Wunderlist and now deeply integrated into the Microsoft 365 suite.It focuses on simple, intuitive task management, allowing users to create lists for work, personal life, and other commitments with easy drag-and-drop prioritization.A standout feature is the **'My Day'** planner, which suggests tasks from your various lists and provides a focused view of what you plan to accomplish today.\nTasks can have due dates, reminders, and recurring schedules, and they can be organized using hashtags for easy filtering and searching.Its key value proposition is its synchronization with other Microsoft products, automatically pulling in tasks created in Outlook and integrating with the full M365 environment.Users can share lists with others for collaborative task management, such as a family grocery list or a small team's action items from a meeting.\nIt also offers 'Suggestions' based on tasks that are due soon or have overdue reminders, helping users maintain a clean and up-to-date to-do list.Microsoft To Do is the ideal personal task management tool for users heavily invested in the Microsoft ecosystem, seeking seamless integration with their email and calendar.",
    "size": 150,
    "reviews": "120K",
    "ratingAvg": 4.6,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 35000 },
      { "name": "4 star", "count": 450000 },
      { "name": "5 star", "count": 900000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/L8bNw8zb/calendly.png",
    "title": "Calendly",
    "companyName": "Calendly LLC",
    "id": 15,
    "description": "Calendly is a highly efficient **scheduling automation platform** designed to eliminate the back-and-forth emails required to book meetings.It connects to the user's personal calendar (Google, Outlook, etc.) to see their availability and then generates a shareable link for others to book time in an open slot.\nThe platform allows users to define different types of meetings with pre-set durations, buffer times, and specific instructions, controlling their schedule effectively.When a person clicks the link, they see only the times when the user is free, select a time that works for them, and the meeting is automatically created in both calendars.Key features include the ability to host group meetings, collect information from attendees via custom intake forms, and automate meeting reminders.\nIt is widely used by sales professionals, recruiters, consultants, and anyone whose job involves frequent external scheduling to save time and streamline the booking process.Calendly offers robust integration with video conferencing services (like Zoom and Google Meet), which are automatically added to the calendar invitation.This tool is an invaluable asset for improving professional efficiency, providing a polished and frictionless experience for anyone looking to book time with you.",
    "size": 95,
    "reviews": "15K",
    "ratingAvg": 4.4,
    "downloads": "100K",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 9000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/y8ZZ61MZ/clickup.png",
    "title": "ClickUp",
    "companyName": "ClickUp",
    "id": 16,
    "description": "ClickUp markets itself as the **'one app to replace them all'**, functioning as an all-in-one productivity platform that merges tasks, documents, goals, time tracking, and collaboration.It offers an extremely customizable hierarchy (Spaces, Folders, Lists, Tasks) and over 15 different ways to view work, including Kanban boards, Gantt charts, tables, and mind maps.Its core strength is its massive feature set, providing native solutions for task management, internal wikis, team communication, and basic CRM functionality.\nUsers can assign tasks, create complex dependencies, set custom statuses, and utilize the built-in time tracking to monitor work allocation and project hours.The platform is highly scalable, suitable for individual users needing to organize their life to large enterprises managing complex product development cycles.\nDocs functionality allows for co-editing and collaboration on long-form content, seamlessly linking documentation to related tasks and projects.While powerful, the sheer number of features can lead to a steep learning curve and complexity, which is often cited in user feedback.ClickUp is best for teams that need to consolidate multiple tools into one platform and require a deeply customizable and feature-rich work operating system.",
    "size": 220,
    "reviews": "19K",
    "ratingAvg": 3.8,
    "downloads": "100K",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 10000 }
    ]
  },
  {
    "image": "https://i.  postimg.cc/JnhgCk94/icon1.webp",
    "title": "Forest: Stay Focused",
    "companyName": "Seekrtech",
    "id": 17,
    "description": "Forest is a unique **focus-timer and anti-distraction app** that employs a gamified approach to help users stay off their phones and concentrate on their work.When a user wants to focus, they 'plant' a virtual tree. This tree grows while the timer is running, representing a period of uninterrupted work.If the user leaves the app before the timer ends, the tree withers and dies, providing a gentle, motivational incentive to remain focused and committed to the task.\nIt functions as a simple **Pomodoro-like focus tool**, allowing users to set various duration timers (typically 25 minutes for a 'pomodoro') and manage their focused sessions.Over time, a user grows an entire virtual forest, which visually represents their cumulative focus time and productivity achievements.\nIn a notable real-world component, Forest partners with a tree-planting organization, allowing users to earn coins to plant *real* trees, adding a social and environmental purpose to the app.It is an extremely popular tool for students and individuals struggling with phone addiction and digital distractions during study or work time.Forest successfully blends simple time management with gamification and social good to make the challenging act of focusing more engaging and rewarding.",
    "size": 40,
    "reviews": "786K",
    "ratingAvg": 4.5,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 500000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/q7QM4Wvn/any-do.webp",
    "title": "Any.do",
    "companyName": "Any.do",
    "id": 18,
    "description": "Any.do is a simple, elegant **to-do list, calendar, and reminders application** focused on simple, cross-device task management and daily planning.It aims to combine three critical productivity functions—task management, scheduling, and habit tracking—into one cohesive and aesthetically pleasing interface.The application encourages a daily planning ritual with its 'Plan My Day' feature, helping users organize and prioritize their tasks at the beginning of each day.\nKey features include organizing tasks by category or list, setting recurring tasks, and using a voice entry feature for hands-free task capture.Its seamless synchronization across mobile, web, and desktop ensures that your tasks and schedule are always up-to-date and accessible.One of its unique features is the integration of a calendar view, which allows users to see their to-dos alongside their scheduled events, providing a holistic view of their commitments.\nCollaboration is supported through the ability to share lists with others, making it useful for managing shared family tasks or simple team assignments.Any.do is designed for the user who values a clean, intuitive interface and needs a reliable, straightforward digital planner to manage their personal and professional life.",
    "size": 160,
    "reviews": "50K",
    "ratingAvg": 4.2,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 264000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/vZJSDmcB/pocket.png",
    "title": "Pocket",
    "companyName": "Mozilla (Pocket)",
    "id": 19,
    "description": "Pocket is a dedicated **'read it later' service** that allows users to save articles, videos, and webpages from any source to view later in a clean, distraction-free environment.It functions as a digital bookmarking tool and personal library for content, ensuring that interesting links don't get lost in a sea of browser tabs or social media feeds.\nOnce saved, content is stripped of all extraneous website clutter (ads, sidebars, etc.), reformatted for easy reading, and made available for **offline reading**.Users can tag and categorize their saved items, making it easy to search and retrieve specific articles for later research or reference purposes.A unique feature is its robust text-to-speech functionality, allowing users to listen to saved articles when they are unable to look at a screen.It also offers a personalized feed of recommended content based on the user's saved items, helping with discovery of related and quality articles.\nPocket is an excellent tool for information curation, research, and anyone looking to minimize digital distractions by scheduling their consumption of long-form content.It helps users transition from an impulsive browsing habit to a deliberate, focused reading routine by acting as a temporary storage and viewing platform for web content.",
    "size": 75,
    "reviews": "2K",
    "ratingAvg": 4.5,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 122000 }
    ]
  },
  {
    "image": "https://i.postimg.cc/FKvg2kYH/rescuetime.jpg",
    "title": "RescueTime",
    "companyName": "RescueTime",
    "id": 20,
    "description": "RescueTime is an advanced **automatic time-tracking and productivity analytics** application that runs silently in the background across desktop and mobile devices.It automatically categorizes and monitors the time spent on various websites and applications, removing the need for manual time-logging.\nThe platform provides detailed reports and charts that show users exactly where their time is being spent, highlighting both productive and distracting activities.Users can set daily or weekly **productivity goals** (e.g., 'Spend at least 3 hours on coding') and track their progress toward them using color-coded metrics.It calculates a **'Productivity Pulse'** score, which gives an overall measure of how focused and productive the user has been throughout the day.For distraction management, it offers a 'FocusTime' feature that can temporarily block access to specific distracting websites and applications to enforce concentration.\nRescueTime is a data-driven tool, providing the objective information necessary for self-analysis and improvement of time allocation and work habits.It is primarily used by freelancers, professionals, and remote workers who need to accurately bill for their time or gain deep insights into their personal efficiency patterns.",
    "size": 65,
    "reviews": "3K",
    "ratingAvg": 3.3,
    "downloads": "50K",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 660 }
    ]
  },
  {
    "image": "https://i.postimg.cc/V6VtLJk4/grammerly.png",
    "title": "Grammarly: AI Writing Assistant",
    "companyName": "Grammarly, Inc.",
    "id": 21,
    "description": "Grammarly is an industry-leading **AI-powered writing assistant** that goes far beyond simple spell-checking to enhance the quality and effectiveness of text.It checks for a broad range of grammatical errors, punctuation mistakes, and sentence structure issues in real-time as a user types.\nIts advanced features include suggestions for improving **clarity** and conciseness, correcting awkward phrasing, and eliminating wordiness to ensure the message is easily understood.A critical component is its **tone detection**, which analyzes word choice and structure to advise users on how their message is likely to be perceived (e.g., confident, formal, friendly).\nIt offers a robust **plagiarism checker** that scans billions of web pages to ensure the originality of a document, a vital feature for academic and professional writers.Grammarly works across numerous platforms via browser extensions, a desktop application, and mobile keyboard integrations, ensuring consistent quality across all digital communication.Users can set goals for their writing based on audience, formality, and intent, allowing the AI to tailor its suggestions to the specific context.Grammarly is an indispensable tool for anyone who writes professional emails, reports, social media content, or academic papers and needs to ensure their communication is error-free and impactful.",
    "size": 120,
    "reviews": "3M",
    "ratingAvg": 4.3,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 35000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 980000 }
    ]
  }
]
